//FRAUDBTC     JOB (ACCT), 'AUDITORIA SEGUROS'
//STEP10       EXEC PGM=SORT
//SYSOUT       DD SYSOUT=*
//SORTIN       DD DSN=INFILE,DISP=SHR
//SORTOUT      DD DSN=OUTFILE,DISP=(NEW,CATLG),
//             SPACE=(CYL,(1,1)),
//             DCB=(RECFM=FB,LRECL=88)
//SYSIN        DD *
  SORT FIELDS=(1,9,CH,A)
  INCLUDE COND=(6,2,CH,EQ,C,'FR') 
  /* 
